In [1]:
import sys
# !{sys.executable} -m pip install pymysql mysqlclient jupysql

In [2]:
import os
from dotenv import load_dotenv

load_dotenv()

True

In [3]:
# user = os.environ["DB_USERNAME"]
# pwd = os.environ["DB_PASSWORD"]
# host = os.environ["DB_HOST"]

In [4]:
%load_ext sql
%sql mysql+mysqldb://$DB_USERNAME:$DB_PASSWORD@$DB_HOST:3306/parks_and_recreation
%config SqlMagic.displaylimit = None

Connecting to 'mysql+mysqldb://root:***@localhost:3306/parks_and_recreation'

displaylimit: Value None will be treated as 0 (no limit)

## SQL_01

In [5]:
%%sql
SELECT *
FROM parks_and_recreation.employee_demographics;

Running query in 'mysql+mysqldb://root:***@localhost:3306/parks_and_recreation'

11 rows affected.

+-------------+------------+--------------+-----+--------+------------+
| employee_id | first_name |  last_name   | age | gender | birth_date |
+-------------+------------+--------------+-----+--------+------------+
|      1      |   Leslie   |    Knope     |  44 | Female | 1979-09-25 |
|      3      |    Tom     |  Haverford   |  36 |  Male  | 1987-03-04 |
|      4      |   April    |   Ludgate    |  29 | Female | 1994-03-27 |
|      5      |   Jerry    |   Gergich    |  61 |  Male  | 1962-08-28 |
|      6      |   Donna    |    Meagle    |  46 | Female | 1977-07-30 |
|      7      |    Ann     |   Perkins    |  35 | Female | 1988-12-01 |
|      8      |   Chris    |   Traeger    |  43 |  Male  | 1980-11-11 |
|      9      |    Ben     |    Wyatt     |  38 |  Male  | 1985-07-26 |
|      10     |    Andy    |    Dwyer     |  34 |  Male  | 1989-03-25 |
|      11     |    Mark    | Brendanawicz |  40 |  Male  | 1983-06-14 |
|      12     |   Craig    | Middlebrooks |  37 |  Male  | 1986-07-27 |
+-------------+------------+--------------+-----+--------+------------+

In [6]:
%%sql
SELECT first_name
FROM parks_and_recreation.employee_demographics;

Running query in 'mysql+mysqldb://root:***@localhost:3306/parks_and_recreation'

11 rows affected.

+------------+
| first_name |
+------------+
|   Leslie   |
|    Tom     |
|   April    |
|   Jerry    |
|   Donna    |
|    Ann     |
|   Chris    |
|    Ben     |
|    Andy    |
|    Mark    |
|   Craig    |
+------------+

In [7]:
%%sql
SELECT first_name, last_name, birth_date
FROM parks_and_recreation.employee_demographics;

Running query in 'mysql+mysqldb://root:***@localhost:3306/parks_and_recreation'

11 rows affected.

+------------+--------------+------------+
| first_name |  last_name   | birth_date |
+------------+--------------+------------+
|   Leslie   |    Knope     | 1979-09-25 |
|    Tom     |  Haverford   | 1987-03-04 |
|   April    |   Ludgate    | 1994-03-27 |
|   Jerry    |   Gergich    | 1962-08-28 |
|   Donna    |    Meagle    | 1977-07-30 |
|    Ann     |   Perkins    | 1988-12-01 |
|   Chris    |   Traeger    | 1980-11-11 |
|    Ben     |    Wyatt     | 1985-07-26 |
|    Andy    |    Dwyer     | 1989-03-25 |
|    Mark    | Brendanawicz | 1983-06-14 |
|   Craig    | Middlebrooks | 1986-07-27 |
+------------+--------------+------------+

In [8]:
%%sql
SELECT first_name,
last_name,
birth_date,
age,
age + 10 as op_1,
(age + 10) * 2 as op_2,
age + 10 * 2 as op_3 # example
FROM parks_and_recreation.employee_demographics;

Running query in 'mysql+mysqldb://root:***@localhost:3306/parks_and_recreation'

11 rows affected.

+------------+--------------+------------+-----+------+------+------+
| first_name |  last_name   | birth_date | age | op_1 | op_2 | op_3 |
+------------+--------------+------------+-----+------+------+------+
|   Leslie   |    Knope     | 1979-09-25 |  44 |  54  | 108  |  64  |
|    Tom     |  Haverford   | 1987-03-04 |  36 |  46  |  92  |  56  |
|   April    |   Ludgate    | 1994-03-27 |  29 |  39  |  78  |  49  |
|   Jerry    |   Gergich    | 1962-08-28 |  61 |  71  | 142  |  81  |
|   Donna    |    Meagle    | 1977-07-30 |  46 |  56  | 112  |  66  |
|    Ann     |   Perkins    | 1988-12-01 |  35 |  45  |  90  |  55  |
|   Chris    |   Traeger    | 1980-11-11 |  43 |  53  | 106  |  63  |
|    Ben     |    Wyatt     | 1985-07-26 |  38 |  48  |  96  |  58  |
|    Andy    |    Dwyer     | 1989-03-25 |  34 |  44  |  88  |  54  |
|    Mark    | Brendanawicz | 1983-06-14 |  40 |  50  | 100  |  60  |
|   Craig    | Middlebrooks | 1986-07-27 |  37 |  47  |  94  |  57  |
+------------+--------------+------------+-----+------+------+------+

**PAMDAS**: Parentheses (Paréntesis), Exponents (Exponentes) , Multiplication-Division (Multiplicación-División), Addition-Subtraction (Suma y resta).

In [9]:
%%sql
SELECT distinct(gender), count(gender) as total
FROM parks_and_recreation.employee_demographics
GROUP BY gender
ORDER BY total desc;

Running query in 'mysql+mysqldb://root:***@localhost:3306/parks_and_recreation'

2 rows affected.

+--------+-------+
| gender | total |
+--------+-------+
|  Male  |   7   |
| Female |   4   |
+--------+-------+

## SQL_02

In [10]:
%%sql
SELECT *
FROM parks_and_recreation.employee_salary
WHERE first_name = "Leslie";

Running query in 'mysql+mysqldb://root:***@localhost:3306/parks_and_recreation'

1 rows affected.

+-------------+------------+-----------+-----------------------------------------+--------+---------+
| employee_id | first_name | last_name |                occupation               | salary | dept_id |
+-------------+------------+-----------+-----------------------------------------+--------+---------+
|      1      |   Leslie   |   Knope   | Deputy Director of Parks and Recreation | 75000  |    1    |
+-------------+------------+-----------+-----------------------------------------+--------+---------+

In [11]:
%%sql
SELECT *
FROM parks_and_recreation.employee_salary
WHERE salary >= 50000;

Running query in 'mysql+mysqldb://root:***@localhost:3306/parks_and_recreation'

10 rows affected.

+-------------+------------+--------------+-----------------------------------------+--------+---------+
| employee_id | first_name |  last_name   |                occupation               | salary | dept_id |
+-------------+------------+--------------+-----------------------------------------+--------+---------+
|      1      |   Leslie   |    Knope     | Deputy Director of Parks and Recreation | 75000  |    1    |
|      2      |    Ron     |   Swanson    |     Director of Parks and Recreation    | 70000  |    1    |
|      3      |    Tom     |  Haverford   |               Entrepreneur              | 50000  |    1    |
|      5      |   Jerry    |   Gergich    |              Office Manager             | 50000  |    1    |
|      6      |   Donna    |    Meagle    |              Office Manager             | 60000  |    1    |
|      7      |    Ann     |   Perkins    |                  Nurse                  | 55000  |    4    |
|      8      |   Chris    |   Traeger    |               City Manager              | 90000  |    3    |
|      9      |    Ben     |    Wyatt     |              State Auditor              | 70000  |    6    |
|      11     |    Mark    | Brendanawicz |               City Planner              | 57000  |    3    |
|      12     |   Craig    | Middlebrooks |              Parks Director             | 65000  |    1    |
+-------------+------------+--------------+-----------------------------------------+--------+---------+

In [12]:
%%sql
SELECT *
FROM parks_and_recreation.employee_salary
WHERE salary <= 50000;

Running query in 'mysql+mysqldb://root:***@localhost:3306/parks_and_recreation'

4 rows affected.

+-------------+------------+-----------+---------------------------------------------------+--------+---------+
| employee_id | first_name | last_name |                     occupation                    | salary | dept_id |
+-------------+------------+-----------+---------------------------------------------------+--------+---------+
|      3      |    Tom     | Haverford |                    Entrepreneur                   | 50000  |    1    |
|      4      |   April    |  Ludgate  | Assistant to the Director of Parks and Recreation | 25000  |    1    |
|      5      |   Jerry    |  Gergich  |                   Office Manager                  | 50000  |    1    |
|      10     |    Andy    |   Dwyer   |              Shoe Shiner and Musician             | 20000  |   None  |
+-------------+------------+-----------+---------------------------------------------------+--------+---------+

In [13]:
%%sql
SELECT *
FROM parks_and_recreation.employee_demographics;

Running query in 'mysql+mysqldb://root:***@localhost:3306/parks_and_recreation'

11 rows affected.

+-------------+------------+--------------+-----+--------+------------+
| employee_id | first_name |  last_name   | age | gender | birth_date |
+-------------+------------+--------------+-----+--------+------------+
|      1      |   Leslie   |    Knope     |  44 | Female | 1979-09-25 |
|      3      |    Tom     |  Haverford   |  36 |  Male  | 1987-03-04 |
|      4      |   April    |   Ludgate    |  29 | Female | 1994-03-27 |
|      5      |   Jerry    |   Gergich    |  61 |  Male  | 1962-08-28 |
|      6      |   Donna    |    Meagle    |  46 | Female | 1977-07-30 |
|      7      |    Ann     |   Perkins    |  35 | Female | 1988-12-01 |
|      8      |   Chris    |   Traeger    |  43 |  Male  | 1980-11-11 |
|      9      |    Ben     |    Wyatt     |  38 |  Male  | 1985-07-26 |
|      10     |    Andy    |    Dwyer     |  34 |  Male  | 1989-03-25 |
|      11     |    Mark    | Brendanawicz |  40 |  Male  | 1983-06-14 |
|      12     |   Craig    | Middlebrooks |  37 |  Male  | 1986-07-27 |
+-------------+------------+--------------+-----+--------+------------+

In [14]:
%%sql
SELECT *
FROM parks_and_recreation.employee_demographics
WHERE gender = "Female";

Running query in 'mysql+mysqldb://root:***@localhost:3306/parks_and_recreation'

4 rows affected.

+-------------+------------+-----------+-----+--------+------------+
| employee_id | first_name | last_name | age | gender | birth_date |
+-------------+------------+-----------+-----+--------+------------+
|      1      |   Leslie   |   Knope   |  44 | Female | 1979-09-25 |
|      4      |   April    |  Ludgate  |  29 | Female | 1994-03-27 |
|      6      |   Donna    |   Meagle  |  46 | Female | 1977-07-30 |
|      7      |    Ann     |  Perkins  |  35 | Female | 1988-12-01 |
+-------------+------------+-----------+-----+--------+------------+

In [15]:
%%sql
SELECT *
FROM parks_and_recreation.employee_demographics
WHERE gender != "Female";

Running query in 'mysql+mysqldb://root:***@localhost:3306/parks_and_recreation'

7 rows affected.

+-------------+------------+--------------+-----+--------+------------+
| employee_id | first_name |  last_name   | age | gender | birth_date |
+-------------+------------+--------------+-----+--------+------------+
|      3      |    Tom     |  Haverford   |  36 |  Male  | 1987-03-04 |
|      5      |   Jerry    |   Gergich    |  61 |  Male  | 1962-08-28 |
|      8      |   Chris    |   Traeger    |  43 |  Male  | 1980-11-11 |
|      9      |    Ben     |    Wyatt     |  38 |  Male  | 1985-07-26 |
|      10     |    Andy    |    Dwyer     |  34 |  Male  | 1989-03-25 |
|      11     |    Mark    | Brendanawicz |  40 |  Male  | 1983-06-14 |
|      12     |   Craig    | Middlebrooks |  37 |  Male  | 1986-07-27 |
+-------------+------------+--------------+-----+--------+------------+

In [16]:
%%sql
SELECT *
FROM parks_and_recreation.employee_demographics
WHERE birth_date >= "1985-01-01";

Running query in 'mysql+mysqldb://root:***@localhost:3306/parks_and_recreation'

6 rows affected.

+-------------+------------+--------------+-----+--------+------------+
| employee_id | first_name |  last_name   | age | gender | birth_date |
+-------------+------------+--------------+-----+--------+------------+
|      3      |    Tom     |  Haverford   |  36 |  Male  | 1987-03-04 |
|      4      |   April    |   Ludgate    |  29 | Female | 1994-03-27 |
|      7      |    Ann     |   Perkins    |  35 | Female | 1988-12-01 |
|      9      |    Ben     |    Wyatt     |  38 |  Male  | 1985-07-26 |
|      10     |    Andy    |    Dwyer     |  34 |  Male  | 1989-03-25 |
|      12     |   Craig    | Middlebrooks |  37 |  Male  | 1986-07-27 |
+-------------+------------+--------------+-----+--------+------------+

In [17]:
%%sql
SELECT *
FROM parks_and_recreation.employee_demographics
WHERE birth_date > "1985-01-01" AND gender = "male";

Running query in 'mysql+mysqldb://root:***@localhost:3306/parks_and_recreation'

4 rows affected.

+-------------+------------+--------------+-----+--------+------------+
| employee_id | first_name |  last_name   | age | gender | birth_date |
+-------------+------------+--------------+-----+--------+------------+
|      3      |    Tom     |  Haverford   |  36 |  Male  | 1987-03-04 |
|      9      |    Ben     |    Wyatt     |  38 |  Male  | 1985-07-26 |
|      10     |    Andy    |    Dwyer     |  34 |  Male  | 1989-03-25 |
|      12     |   Craig    | Middlebrooks |  37 |  Male  | 1986-07-27 |
+-------------+------------+--------------+-----+--------+------------+

In [18]:
%%sql
SELECT *
FROM parks_and_recreation.employee_demographics
WHERE birth_date > "1985-01-01" OR gender = "male";

Running query in 'mysql+mysqldb://root:***@localhost:3306/parks_and_recreation'

9 rows affected.

+-------------+------------+--------------+-----+--------+------------+
| employee_id | first_name |  last_name   | age | gender | birth_date |
+-------------+------------+--------------+-----+--------+------------+
|      3      |    Tom     |  Haverford   |  36 |  Male  | 1987-03-04 |
|      4      |   April    |   Ludgate    |  29 | Female | 1994-03-27 |
|      5      |   Jerry    |   Gergich    |  61 |  Male  | 1962-08-28 |
|      7      |    Ann     |   Perkins    |  35 | Female | 1988-12-01 |
|      8      |   Chris    |   Traeger    |  43 |  Male  | 1980-11-11 |
|      9      |    Ben     |    Wyatt     |  38 |  Male  | 1985-07-26 |
|      10     |    Andy    |    Dwyer     |  34 |  Male  | 1989-03-25 |
|      11     |    Mark    | Brendanawicz |  40 |  Male  | 1983-06-14 |
|      12     |   Craig    | Middlebrooks |  37 |  Male  | 1986-07-27 |
+-------------+------------+--------------+-----+--------+------------+

In [19]:
%%sql
SELECT *
FROM parks_and_recreation.employee_demographics
WHERE birth_date > "1985-01-01" OR NOT gender = "male";

Running query in 'mysql+mysqldb://root:***@localhost:3306/parks_and_recreation'

8 rows affected.

+-------------+------------+--------------+-----+--------+------------+
| employee_id | first_name |  last_name   | age | gender | birth_date |
+-------------+------------+--------------+-----+--------+------------+
|      1      |   Leslie   |    Knope     |  44 | Female | 1979-09-25 |
|      3      |    Tom     |  Haverford   |  36 |  Male  | 1987-03-04 |
|      4      |   April    |   Ludgate    |  29 | Female | 1994-03-27 |
|      6      |   Donna    |    Meagle    |  46 | Female | 1977-07-30 |
|      7      |    Ann     |   Perkins    |  35 | Female | 1988-12-01 |
|      9      |    Ben     |    Wyatt     |  38 |  Male  | 1985-07-26 |
|      10     |    Andy    |    Dwyer     |  34 |  Male  | 1989-03-25 |
|      12     |   Craig    | Middlebrooks |  37 |  Male  | 1986-07-27 |
+-------------+------------+--------------+-----+--------+------------+

In [20]:
%%sql
SELECT *
FROM parks_and_recreation.employee_demographics
WHERE first_name LIKE "a%"; --inicia con "a"

Running query in 'mysql+mysqldb://root:***@localhost:3306/parks_and_recreation'

3 rows affected.

+-------------+------------+-----------+-----+--------+------------+
| employee_id | first_name | last_name | age | gender | birth_date |
+-------------+------------+-----------+-----+--------+------------+
|      4      |   April    |  Ludgate  |  29 | Female | 1994-03-27 |
|      7      |    Ann     |  Perkins  |  35 | Female | 1988-12-01 |
|      10     |    Andy    |   Dwyer   |  34 |  Male  | 1989-03-25 |
+-------------+------------+-----------+-----+--------+------------+

In [21]:
%%sql
SELECT *
FROM parks_and_recreation.employee_demographics
WHERE first_name LIKE "a___%"; --underscore only one character (any)

Running query in 'mysql+mysqldb://root:***@localhost:3306/parks_and_recreation'

2 rows affected.

+-------------+------------+-----------+-----+--------+------------+
| employee_id | first_name | last_name | age | gender | birth_date |
+-------------+------------+-----------+-----+--------+------------+
|      4      |   April    |  Ludgate  |  29 | Female | 1994-03-27 |
|      10     |    Andy    |   Dwyer   |  34 |  Male  | 1989-03-25 |
+-------------+------------+-----------+-----+--------+------------+

In [22]:
%%sql
SELECT *
FROM parks_and_recreation.employee_demographics
WHERE birth_date LIKE "1989%";

Running query in 'mysql+mysqldb://root:***@localhost:3306/parks_and_recreation'

1 rows affected.

+-------------+------------+-----------+-----+--------+------------+
| employee_id | first_name | last_name | age | gender | birth_date |
+-------------+------------+-----------+-----+--------+------------+
|      10     |    Andy    |   Dwyer   |  34 |  Male  | 1989-03-25 |
+-------------+------------+-----------+-----+--------+------------+

## SQL_03

In [23]:
%%sql
SELECT *
FROM parks_and_recreation.employee_demographics;

Running query in 'mysql+mysqldb://root:***@localhost:3306/parks_and_recreation'

11 rows affected.

+-------------+------------+--------------+-----+--------+------------+
| employee_id | first_name |  last_name   | age | gender | birth_date |
+-------------+------------+--------------+-----+--------+------------+
|      1      |   Leslie   |    Knope     |  44 | Female | 1979-09-25 |
|      3      |    Tom     |  Haverford   |  36 |  Male  | 1987-03-04 |
|      4      |   April    |   Ludgate    |  29 | Female | 1994-03-27 |
|      5      |   Jerry    |   Gergich    |  61 |  Male  | 1962-08-28 |
|      6      |   Donna    |    Meagle    |  46 | Female | 1977-07-30 |
|      7      |    Ann     |   Perkins    |  35 | Female | 1988-12-01 |
|      8      |   Chris    |   Traeger    |  43 |  Male  | 1980-11-11 |
|      9      |    Ben     |    Wyatt     |  38 |  Male  | 1985-07-26 |
|      10     |    Andy    |    Dwyer     |  34 |  Male  | 1989-03-25 |
|      11     |    Mark    | Brendanawicz |  40 |  Male  | 1983-06-14 |
|      12     |   Craig    | Middlebrooks |  37 |  Male  | 1986-07-27 |
+-------------+------------+--------------+-----+--------+------------+

In [24]:
%%sql
SELECT gender, count(gender) as total
FROM parks_and_recreation.employee_demographics
GROUP BY gender;

Running query in 'mysql+mysqldb://root:***@localhost:3306/parks_and_recreation'

2 rows affected.

+--------+-------+
| gender | total |
+--------+-------+
| Female |   4   |
|  Male  |   7   |
+--------+-------+

In [25]:
%%sql
SELECT gender, AVG(age)
FROM parks_and_recreation.employee_demographics
GROUP BY gender;

Running query in 'mysql+mysqldb://root:***@localhost:3306/parks_and_recreation'

2 rows affected.

+--------+----------+
| gender | AVG(age) |
+--------+----------+
| Female | 38.5000  |
|  Male  | 41.2857  |
+--------+----------+

In [26]:
%%sql
SELECT occupation, count(occupation)
FROM parks_and_recreation.employee_salary
GROUP BY occupation;

Running query in 'mysql+mysqldb://root:***@localhost:3306/parks_and_recreation'

11 rows affected.

+---------------------------------------------------+-------------------+
|                     occupation                    | count(occupation) |
+---------------------------------------------------+-------------------+
|      Deputy Director of Parks and Recreation      |         1         |
|          Director of Parks and Recreation         |         1         |
|                    Entrepreneur                   |         1         |
| Assistant to the Director of Parks and Recreation |         1         |
|                   Office Manager                  |         2         |
|                       Nurse                       |         1         |
|                    City Manager                   |         1         |
|                   State Auditor                   |         1         |
|              Shoe Shiner and Musician             |         1         |
|                    City Planner                   |         1         |
|                   Parks Director                  |         1         |
+---------------------------------------------------+-------------------+

In [27]:
%%sql
SELECT occupation, salary
FROM parks_and_recreation.employee_salary
GROUP BY occupation, salary;

Running query in 'mysql+mysqldb://root:***@localhost:3306/parks_and_recreation'

12 rows affected.

+---------------------------------------------------+--------+
|                     occupation                    | salary |
+---------------------------------------------------+--------+
|      Deputy Director of Parks and Recreation      | 75000  |
|          Director of Parks and Recreation         | 70000  |
|                    Entrepreneur                   | 50000  |
| Assistant to the Director of Parks and Recreation | 25000  |
|                   Office Manager                  | 50000  |
|                   Office Manager                  | 60000  |
|                       Nurse                       | 55000  |
|                    City Manager                   | 90000  |
|                   State Auditor                   | 70000  |
|              Shoe Shiner and Musician             | 20000  |
|                    City Planner                   | 57000  |
|                   Parks Director                  | 65000  |
+---------------------------------------------------+--------+

In [28]:
%%sql
SELECT gender, AVG(age), MAX(age), MIN(age), COUNT(age)
FROM parks_and_recreation.employee_demographics
GROUP BY gender;

Running query in 'mysql+mysqldb://root:***@localhost:3306/parks_and_recreation'

2 rows affected.

+--------+----------+----------+----------+------------+
| gender | AVG(age) | MAX(age) | MIN(age) | COUNT(age) |
+--------+----------+----------+----------+------------+
| Female | 38.5000  |    46    |    29    |     4      |
|  Male  | 41.2857  |    61    |    34    |     7      |
+--------+----------+----------+----------+------------+

In [29]:
%%sql
SELECT *
FROM parks_and_recreation.employee_demographics;

Running query in 'mysql+mysqldb://root:***@localhost:3306/parks_and_recreation'

11 rows affected.

+-------------+------------+--------------+-----+--------+------------+
| employee_id | first_name |  last_name   | age | gender | birth_date |
+-------------+------------+--------------+-----+--------+------------+
|      1      |   Leslie   |    Knope     |  44 | Female | 1979-09-25 |
|      3      |    Tom     |  Haverford   |  36 |  Male  | 1987-03-04 |
|      4      |   April    |   Ludgate    |  29 | Female | 1994-03-27 |
|      5      |   Jerry    |   Gergich    |  61 |  Male  | 1962-08-28 |
|      6      |   Donna    |    Meagle    |  46 | Female | 1977-07-30 |
|      7      |    Ann     |   Perkins    |  35 | Female | 1988-12-01 |
|      8      |   Chris    |   Traeger    |  43 |  Male  | 1980-11-11 |
|      9      |    Ben     |    Wyatt     |  38 |  Male  | 1985-07-26 |
|      10     |    Andy    |    Dwyer     |  34 |  Male  | 1989-03-25 |
|      11     |    Mark    | Brendanawicz |  40 |  Male  | 1983-06-14 |
|      12     |   Craig    | Middlebrooks |  37 |  Male  | 1986-07-27 |
+-------------+------------+--------------+-----+--------+------------+

In [30]:
%%sql
SELECT *
FROM parks_and_recreation.employee_demographics
ORDER BY first_name ASC;

Running query in 'mysql+mysqldb://root:***@localhost:3306/parks_and_recreation'

11 rows affected.

+-------------+------------+--------------+-----+--------+------------+
| employee_id | first_name |  last_name   | age | gender | birth_date |
+-------------+------------+--------------+-----+--------+------------+
|      10     |    Andy    |    Dwyer     |  34 |  Male  | 1989-03-25 |
|      7      |    Ann     |   Perkins    |  35 | Female | 1988-12-01 |
|      4      |   April    |   Ludgate    |  29 | Female | 1994-03-27 |
|      9      |    Ben     |    Wyatt     |  38 |  Male  | 1985-07-26 |
|      8      |   Chris    |   Traeger    |  43 |  Male  | 1980-11-11 |
|      12     |   Craig    | Middlebrooks |  37 |  Male  | 1986-07-27 |
|      6      |   Donna    |    Meagle    |  46 | Female | 1977-07-30 |
|      5      |   Jerry    |   Gergich    |  61 |  Male  | 1962-08-28 |
|      1      |   Leslie   |    Knope     |  44 | Female | 1979-09-25 |
|      11     |    Mark    | Brendanawicz |  40 |  Male  | 1983-06-14 |
|      3      |    Tom     |  Haverford   |  36 |  Male  | 1987-03-04 |
+-------------+------------+--------------+-----+--------+------------+

In [31]:
%%sql
SELECT *
FROM parks_and_recreation.employee_demographics
ORDER BY gender;

Running query in 'mysql+mysqldb://root:***@localhost:3306/parks_and_recreation'

11 rows affected.

+-------------+------------+--------------+-----+--------+------------+
| employee_id | first_name |  last_name   | age | gender | birth_date |
+-------------+------------+--------------+-----+--------+------------+
|      1      |   Leslie   |    Knope     |  44 | Female | 1979-09-25 |
|      4      |   April    |   Ludgate    |  29 | Female | 1994-03-27 |
|      6      |   Donna    |    Meagle    |  46 | Female | 1977-07-30 |
|      7      |    Ann     |   Perkins    |  35 | Female | 1988-12-01 |
|      3      |    Tom     |  Haverford   |  36 |  Male  | 1987-03-04 |
|      5      |   Jerry    |   Gergich    |  61 |  Male  | 1962-08-28 |
|      8      |   Chris    |   Traeger    |  43 |  Male  | 1980-11-11 |
|      9      |    Ben     |    Wyatt     |  38 |  Male  | 1985-07-26 |
|      10     |    Andy    |    Dwyer     |  34 |  Male  | 1989-03-25 |
|      11     |    Mark    | Brendanawicz |  40 |  Male  | 1983-06-14 |
|      12     |   Craig    | Middlebrooks |  37 |  Male  | 1986-07-27 |
+-------------+------------+--------------+-----+--------+------------+

In [32]:
%%sql
SELECT *
FROM parks_and_recreation.employee_demographics
ORDER BY gender, age DESC;

Running query in 'mysql+mysqldb://root:***@localhost:3306/parks_and_recreation'

11 rows affected.

+-------------+------------+--------------+-----+--------+------------+
| employee_id | first_name |  last_name   | age | gender | birth_date |
+-------------+------------+--------------+-----+--------+------------+
|      6      |   Donna    |    Meagle    |  46 | Female | 1977-07-30 |
|      1      |   Leslie   |    Knope     |  44 | Female | 1979-09-25 |
|      7      |    Ann     |   Perkins    |  35 | Female | 1988-12-01 |
|      4      |   April    |   Ludgate    |  29 | Female | 1994-03-27 |
|      5      |   Jerry    |   Gergich    |  61 |  Male  | 1962-08-28 |
|      8      |   Chris    |   Traeger    |  43 |  Male  | 1980-11-11 |
|      11     |    Mark    | Brendanawicz |  40 |  Male  | 1983-06-14 |
|      9      |    Ben     |    Wyatt     |  38 |  Male  | 1985-07-26 |
|      12     |   Craig    | Middlebrooks |  37 |  Male  | 1986-07-27 |
|      3      |    Tom     |  Haverford   |  36 |  Male  | 1987-03-04 |
|      10     |    Andy    |    Dwyer     |  34 |  Male  | 1989-03-25 |
+-------------+------------+--------------+-----+--------+------------+

In [33]:
%%sql
SELECT *
FROM parks_and_recreation.employee_demographics
ORDER BY age, gender;

Running query in 'mysql+mysqldb://root:***@localhost:3306/parks_and_recreation'

11 rows affected.

+-------------+------------+--------------+-----+--------+------------+
| employee_id | first_name |  last_name   | age | gender | birth_date |
+-------------+------------+--------------+-----+--------+------------+
|      4      |   April    |   Ludgate    |  29 | Female | 1994-03-27 |
|      10     |    Andy    |    Dwyer     |  34 |  Male  | 1989-03-25 |
|      7      |    Ann     |   Perkins    |  35 | Female | 1988-12-01 |
|      3      |    Tom     |  Haverford   |  36 |  Male  | 1987-03-04 |
|      12     |   Craig    | Middlebrooks |  37 |  Male  | 1986-07-27 |
|      9      |    Ben     |    Wyatt     |  38 |  Male  | 1985-07-26 |
|      11     |    Mark    | Brendanawicz |  40 |  Male  | 1983-06-14 |
|      8      |   Chris    |   Traeger    |  43 |  Male  | 1980-11-11 |
|      1      |   Leslie   |    Knope     |  44 | Female | 1979-09-25 |
|      6      |   Donna    |    Meagle    |  46 | Female | 1977-07-30 |
|      5      |   Jerry    |   Gergich    |  61 |  Male  | 1962-08-28 |
+-------------+------------+--------------+-----+--------+------------+

In [34]:
%%sql
SELECT *
FROM parks_and_recreation.employee_demographics
ORDER BY 5, 4; --columns

Running query in 'mysql+mysqldb://root:***@localhost:3306/parks_and_recreation'

11 rows affected.

+-------------+------------+--------------+-----+--------+------------+
| employee_id | first_name |  last_name   | age | gender | birth_date |
+-------------+------------+--------------+-----+--------+------------+
|      4      |   April    |   Ludgate    |  29 | Female | 1994-03-27 |
|      7      |    Ann     |   Perkins    |  35 | Female | 1988-12-01 |
|      1      |   Leslie   |    Knope     |  44 | Female | 1979-09-25 |
|      6      |   Donna    |    Meagle    |  46 | Female | 1977-07-30 |
|      10     |    Andy    |    Dwyer     |  34 |  Male  | 1989-03-25 |
|      3      |    Tom     |  Haverford   |  36 |  Male  | 1987-03-04 |
|      12     |   Craig    | Middlebrooks |  37 |  Male  | 1986-07-27 |
|      9      |    Ben     |    Wyatt     |  38 |  Male  | 1985-07-26 |
|      11     |    Mark    | Brendanawicz |  40 |  Male  | 1983-06-14 |
|      8      |   Chris    |   Traeger    |  43 |  Male  | 1980-11-11 |
|      5      |   Jerry    |   Gergich    |  61 |  Male  | 1962-08-28 |
+-------------+------------+--------------+-----+--------+------------+

## SQL_04
Having vs. Where

In [35]:
%%sql
SELECT gender, AVG(age)
FROM parks_and_recreation.employee_demographics
GROUP BY gender;

Running query in 'mysql+mysqldb://root:***@localhost:3306/parks_and_recreation'

2 rows affected.

+--------+----------+
| gender | AVG(age) |
+--------+----------+
| Female | 38.5000  |
|  Male  | 41.2857  |
+--------+----------+

In [36]:
%%sql
SELECT gender, AVG(age)
FROM parks_and_recreation.employee_demographics
GROUP BY gender
HAVING AVG(age) > 40;

Running query in 'mysql+mysqldb://root:***@localhost:3306/parks_and_recreation'

1 rows affected.

+--------+----------+
| gender | AVG(age) |
+--------+----------+
|  Male  | 41.2857  |
+--------+----------+

In [37]:
%%sql
SELECT *
FROM parks_and_recreation.employee_salary;

Running query in 'mysql+mysqldb://root:***@localhost:3306/parks_and_recreation'

12 rows affected.

+-------------+------------+--------------+---------------------------------------------------+--------+---------+
| employee_id | first_name |  last_name   |                     occupation                    | salary | dept_id |
+-------------+------------+--------------+---------------------------------------------------+--------+---------+
|      1      |   Leslie   |    Knope     |      Deputy Director of Parks and Recreation      | 75000  |    1    |
|      2      |    Ron     |   Swanson    |          Director of Parks and Recreation         | 70000  |    1    |
|      3      |    Tom     |  Haverford   |                    Entrepreneur                   | 50000  |    1    |
|      4      |   April    |   Ludgate    | Assistant to the Director of Parks and Recreation | 25000  |    1    |
|      5      |   Jerry    |   Gergich    |                   Office Manager                  | 50000  |    1    |
|      6      |   Donna    |    Meagle    |                   Office Manager                  | 60000  |    1    |
|      7      |    Ann     |   Perkins    |                       Nurse                       | 55000  |    4    |
|      8      |   Chris    |   Traeger    |                    City Manager                   | 90000  |    3    |
|      9      |    Ben     |    Wyatt     |                   State Auditor                   | 70000  |    6    |
|      10     |    Andy    |    Dwyer     |              Shoe Shiner and Musician             | 20000  |   None  |
|      11     |    Mark    | Brendanawicz |                    City Planner                   | 57000  |    3    |
|      12     |   Craig    | Middlebrooks |                   Parks Director                  | 65000  |    1    |
+-------------+------------+--------------+---------------------------------------------------+--------+---------+

In [38]:
%%sql
SELECT occupation, AVG(salary)
FROM parks_and_recreation.employee_salary
GROUP BY occupation;

Running query in 'mysql+mysqldb://root:***@localhost:3306/parks_and_recreation'

11 rows affected.

+---------------------------------------------------+-------------+
|                     occupation                    | AVG(salary) |
+---------------------------------------------------+-------------+
|      Deputy Director of Parks and Recreation      |  75000.0000 |
|          Director of Parks and Recreation         |  70000.0000 |
|                    Entrepreneur                   |  50000.0000 |
| Assistant to the Director of Parks and Recreation |  25000.0000 |
|                   Office Manager                  |  55000.0000 |
|                       Nurse                       |  55000.0000 |
|                    City Manager                   |  90000.0000 |
|                   State Auditor                   |  70000.0000 |
|              Shoe Shiner and Musician             |  20000.0000 |
|                    City Planner                   |  57000.0000 |
|                   Parks Director                  |  65000.0000 |
+---------------------------------------------------+-------------+

In [39]:
%%sql
SELECT occupation, AVG(salary)
FROM parks_and_recreation.employee_salary
WHERE occupation LIKE "%manager%"
GROUP BY occupation;

Running query in 'mysql+mysqldb://root:***@localhost:3306/parks_and_recreation'

2 rows affected.

+----------------+-------------+
|   occupation   | AVG(salary) |
+----------------+-------------+
| Office Manager |  55000.0000 |
|  City Manager  |  90000.0000 |
+----------------+-------------+

In [40]:
%%sql
SELECT occupation, AVG(salary)
FROM parks_and_recreation.employee_salary
WHERE occupation LIKE "%manager%"
GROUP BY occupation
HAVING AVG(salary) > 75000;

Running query in 'mysql+mysqldb://root:***@localhost:3306/parks_and_recreation'

1 rows affected.

+--------------+-------------+
|  occupation  | AVG(salary) |
+--------------+-------------+
| City Manager |  90000.0000 |
+--------------+-------------+

## SQL_04
Limit + Aliasing

In [41]:
%%sql
SELECT *
FROM parks_and_recreation.employee_demographics;

Running query in 'mysql+mysqldb://root:***@localhost:3306/parks_and_recreation'

11 rows affected.

+-------------+------------+--------------+-----+--------+------------+
| employee_id | first_name |  last_name   | age | gender | birth_date |
+-------------+------------+--------------+-----+--------+------------+
|      1      |   Leslie   |    Knope     |  44 | Female | 1979-09-25 |
|      3      |    Tom     |  Haverford   |  36 |  Male  | 1987-03-04 |
|      4      |   April    |   Ludgate    |  29 | Female | 1994-03-27 |
|      5      |   Jerry    |   Gergich    |  61 |  Male  | 1962-08-28 |
|      6      |   Donna    |    Meagle    |  46 | Female | 1977-07-30 |
|      7      |    Ann     |   Perkins    |  35 | Female | 1988-12-01 |
|      8      |   Chris    |   Traeger    |  43 |  Male  | 1980-11-11 |
|      9      |    Ben     |    Wyatt     |  38 |  Male  | 1985-07-26 |
|      10     |    Andy    |    Dwyer     |  34 |  Male  | 1989-03-25 |
|      11     |    Mark    | Brendanawicz |  40 |  Male  | 1983-06-14 |
|      12     |   Craig    | Middlebrooks |  37 |  Male  | 1986-07-27 |
+-------------+------------+--------------+-----+--------+------------+

In [42]:
%%sql
SELECT *
FROM parks_and_recreation.employee_demographics
LIMIT 3;

Running query in 'mysql+mysqldb://root:***@localhost:3306/parks_and_recreation'

3 rows affected.

+-------------+------------+-----------+-----+--------+------------+
| employee_id | first_name | last_name | age | gender | birth_date |
+-------------+------------+-----------+-----+--------+------------+
|      1      |   Leslie   |   Knope   |  44 | Female | 1979-09-25 |
|      3      |    Tom     | Haverford |  36 |  Male  | 1987-03-04 |
|      4      |   April    |  Ludgate  |  29 | Female | 1994-03-27 |
+-------------+------------+-----------+-----+--------+------------+

In [43]:
%%sql
SELECT *
FROM parks_and_recreation.employee_demographics
ORDER BY age DESC;

Running query in 'mysql+mysqldb://root:***@localhost:3306/parks_and_recreation'

11 rows affected.

+-------------+------------+--------------+-----+--------+------------+
| employee_id | first_name |  last_name   | age | gender | birth_date |
+-------------+------------+--------------+-----+--------+------------+
|      5      |   Jerry    |   Gergich    |  61 |  Male  | 1962-08-28 |
|      6      |   Donna    |    Meagle    |  46 | Female | 1977-07-30 |
|      1      |   Leslie   |    Knope     |  44 | Female | 1979-09-25 |
|      8      |   Chris    |   Traeger    |  43 |  Male  | 1980-11-11 |
|      11     |    Mark    | Brendanawicz |  40 |  Male  | 1983-06-14 |
|      9      |    Ben     |    Wyatt     |  38 |  Male  | 1985-07-26 |
|      12     |   Craig    | Middlebrooks |  37 |  Male  | 1986-07-27 |
|      3      |    Tom     |  Haverford   |  36 |  Male  | 1987-03-04 |
|      7      |    Ann     |   Perkins    |  35 | Female | 1988-12-01 |
|      10     |    Andy    |    Dwyer     |  34 |  Male  | 1989-03-25 |
|      4      |   April    |   Ludgate    |  29 | Female | 1994-03-27 |
+-------------+------------+--------------+-----+--------+------------+

In [44]:
%%sql
SELECT *
FROM parks_and_recreation.employee_demographics
ORDER BY age DESc
LIMIT 3, 1;

Running query in 'mysql+mysqldb://root:***@localhost:3306/parks_and_recreation'

1 rows affected.

+-------------+------------+-----------+-----+--------+------------+
| employee_id | first_name | last_name | age | gender | birth_date |
+-------------+------------+-----------+-----+--------+------------+
|      8      |   Chris    |  Traeger  |  43 |  Male  | 1980-11-11 |
+-------------+------------+-----------+-----+--------+------------+

In [45]:
%%sql
SELECT gender, AVG(age)
FROM parks_and_recreation.employee_demographics
GROUP BY gender;

Running query in 'mysql+mysqldb://root:***@localhost:3306/parks_and_recreation'

2 rows affected.

+--------+----------+
| gender | AVG(age) |
+--------+----------+
| Female | 38.5000  |
|  Male  | 41.2857  |
+--------+----------+

In [46]:
%%sql
SELECT gender, AVG(age) AS avg_age --AS is "optional"
FROM parks_and_recreation.employee_demographics
GROUP BY gender
HAVING avg_age > 40;

Running query in 'mysql+mysqldb://root:***@localhost:3306/parks_and_recreation'

1 rows affected.

+--------+---------+
| gender | avg_age |
+--------+---------+
|  Male  | 41.2857 |
+--------+---------+

## SQL_05
Joins

![JOINS](pics/joins.png)

### Inner Join

In [47]:
%%sql
SELECT *
FROM parks_and_recreation.employee_demographics
INNER JOIN parks_and_recreation.employee_salary
On employee_demographics.employee_id = employee_salary.employee_id

Running query in 'mysql+mysqldb://root:***@localhost:3306/parks_and_recreation'

11 rows affected.

+-------------+------------+--------------+-----+--------+------------+---------------+--------------+--------------+---------------------------------------------------+--------+---------+
| employee_id | first_name |  last_name   | age | gender | birth_date | employee_id_1 | first_name_1 | last_name_1  |                     occupation                    | salary | dept_id |
+-------------+------------+--------------+-----+--------+------------+---------------+--------------+--------------+---------------------------------------------------+--------+---------+
|      1      |   Leslie   |    Knope     |  44 | Female | 1979-09-25 |       1       |    Leslie    |    Knope     |      Deputy Director of Parks and Recreation      | 75000  |    1    |
|      3      |    Tom     |  Haverford   |  36 |  Male  | 1987-03-04 |       3       |     Tom      |  Haverford   |                    Entrepreneur                   | 50000  |    1    |
|      4      |   April    |   Ludgate    |  29 | Female | 1994-03-27 |       4       |    April     |   Ludgate    | Assistant to the Director of Parks and Recreation | 25000  |    1    |
|      5      |   Jerry    |   Gergich    |  61 |  Male  | 1962-08-28 |       5       |    Jerry     |   Gergich    |                   Office Manager                  | 50000  |    1    |
|      6      |   Donna    |    Meagle    |  46 | Female | 1977-07-30 |       6       |    Donna     |    Meagle    |                   Office Manager                  | 60000  |    1    |
|      7      |    Ann     |   Perkins    |  35 | Female | 1988-12-01 |       7       |     Ann      |   Perkins    |                       Nurse                       | 55000  |    4    |
|      8      |   Chris    |   Traeger    |  43 |  Male  | 1980-11-11 |       8       |    Chris     |   Traeger    |                    City Manager                   | 90000  |    3    |
|      9      |    Ben     |    Wyatt     |  38 |  Male  | 1985-07-26 |       9       |     Ben      |    Wyatt     |                   State Auditor                   | 70000  |    6    |
|      10     |    Andy    |    Dwyer     |  34 |  Male  | 1989-03-25 |       10      |     Andy     |    Dwyer     |              Shoe Shiner and Musician             | 20000  |   None  |
|      11     |    Mark    | Brendanawicz |  40 |  Male  | 1983-06-14 |       11      |     Mark     | Brendanawicz |                    City Planner                   | 57000  |    3    |
|      12     |   Craig    | Middlebrooks |  37 |  Male  | 1986-07-27 |       12      |    Craig     | Middlebrooks |                   Parks Director                  | 65000  |    1    |
+-------------+------------+--------------+-----+--------+------------+---------------+--------------+--------------+---------------------------------------------------+--------+---------+

In [48]:
%%sql
SELECT dem.employee_id, dem.age, sal.occupation
FROM parks_and_recreation.employee_demographics AS dem
INNER JOIN parks_and_recreation.employee_salary AS sal
ON dem.employee_id = sal.employee_id;

Running query in 'mysql+mysqldb://root:***@localhost:3306/parks_and_recreation'

11 rows affected.

+-------------+-----+---------------------------------------------------+
| employee_id | age |                     occupation                    |
+-------------+-----+---------------------------------------------------+
|      1      |  44 |      Deputy Director of Parks and Recreation      |
|      3      |  36 |                    Entrepreneur                   |
|      4      |  29 | Assistant to the Director of Parks and Recreation |
|      5      |  61 |                   Office Manager                  |
|      6      |  46 |                   Office Manager                  |
|      7      |  35 |                       Nurse                       |
|      8      |  43 |                    City Manager                   |
|      9      |  38 |                   State Auditor                   |
|      10     |  34 |              Shoe Shiner and Musician             |
|      11     |  40 |                    City Planner                   |
|      12     |  37 |                   Parks Director                  |
+-------------+-----+---------------------------------------------------+

### Outer Joins

In [49]:
%%sql
SELECT dem.employee_id, dem.age, sal.occupation
FROM parks_and_recreation.employee_demographics AS dem
LEFT JOIN parks_and_recreation.employee_salary AS sal
ON dem.employee_id = sal.employee_id;

Running query in 'mysql+mysqldb://root:***@localhost:3306/parks_and_recreation'

11 rows affected.

+-------------+-----+---------------------------------------------------+
| employee_id | age |                     occupation                    |
+-------------+-----+---------------------------------------------------+
|      1      |  44 |      Deputy Director of Parks and Recreation      |
|      3      |  36 |                    Entrepreneur                   |
|      4      |  29 | Assistant to the Director of Parks and Recreation |
|      5      |  61 |                   Office Manager                  |
|      6      |  46 |                   Office Manager                  |
|      7      |  35 |                       Nurse                       |
|      8      |  43 |                    City Manager                   |
|      9      |  38 |                   State Auditor                   |
|      10     |  34 |              Shoe Shiner and Musician             |
|      11     |  40 |                    City Planner                   |
|      12     |  37 |                   Parks Director                  |
+-------------+-----+---------------------------------------------------+

In [50]:
%%sql
SELECT dem.employee_id, dem.age, sal.occupation
FROM parks_and_recreation.employee_demographics AS dem
RIGHT JOIN parks_and_recreation.employee_salary AS sal
ON dem.employee_id = sal.employee_id;

Running query in 'mysql+mysqldb://root:***@localhost:3306/parks_and_recreation'

12 rows affected.

+-------------+------+---------------------------------------------------+
| employee_id | age  |                     occupation                    |
+-------------+------+---------------------------------------------------+
|      1      |  44  |      Deputy Director of Parks and Recreation      |
|     None    | None |          Director of Parks and Recreation         |
|      3      |  36  |                    Entrepreneur                   |
|      4      |  29  | Assistant to the Director of Parks and Recreation |
|      5      |  61  |                   Office Manager                  |
|      6      |  46  |                   Office Manager                  |
|      7      |  35  |                       Nurse                       |
|      8      |  43  |                    City Manager                   |
|      9      |  38  |                   State Auditor                   |
|      10     |  34  |              Shoe Shiner and Musician             |
|      11     |  40  |                    City Planner                   |
|      12     |  37  |                   Parks Director                  |
+-------------+------+---------------------------------------------------+

Self Join

In [51]:
%%sql
SELECT *
FROM parks_and_recreation.employee_salary emp1
JOIN parks_and_recreation.employee_salary emp2
ON emp1.employee_id = emp2.employee_id;

Running query in 'mysql+mysqldb://root:***@localhost:3306/parks_and_recreation'

12 rows affected.

+-------------+------------+--------------+---------------------------------------------------+--------+---------+---------------+--------------+--------------+---------------------------------------------------+----------+-----------+
| employee_id | first_name |  last_name   |                     occupation                    | salary | dept_id | employee_id_1 | first_name_1 | last_name_1  |                    occupation_1                   | salary_1 | dept_id_1 |
+-------------+------------+--------------+---------------------------------------------------+--------+---------+---------------+--------------+--------------+---------------------------------------------------+----------+-----------+
|      1      |   Leslie   |    Knope     |      Deputy Director of Parks and Recreation      | 75000  |    1    |       1       |    Leslie    |    Knope     |      Deputy Director of Parks and Recreation      |  75000   |     1     |
|      2      |    Ron     |   Swanson    |          Director of Parks and Recreation         | 70000  |    1    |       2       |     Ron      |   Swanson    |          Director of Parks and Recreation         |  70000   |     1     |
|      3      |    Tom     |  Haverford   |                    Entrepreneur                   | 50000  |    1    |       3       |     Tom      |  Haverford   |                    Entrepreneur                   |  50000   |     1     |
|      4      |   April    |   Ludgate    | Assistant to the Director of Parks and Recreation | 25000  |    1    |       4       |    April     |   Ludgate    | Assistant to the Director of Parks and Recreation |  25000   |     1     |
|      5      |   Jerry    |   Gergich    |                   Office Manager                  | 50000  |    1    |       5       |    Jerry     |   Gergich    |                   Office Manager                  |  50000   |     1     |
|      6      |   Donna    |    Meagle    |                   Office Manager                  | 60000  |    1    |       6       |    Donna     |    Meagle    |                   Office Manager                  |  60000   |     1     |
|      7      |    Ann     |   Perkins    |                       Nurse                       | 55000  |    4    |       7       |     Ann      |   Perkins    |                       Nurse                       |  55000   |     4     |
|      8      |   Chris    |   Traeger    |                    City Manager                   | 90000  |    3    |       8       |    Chris     |   Traeger    |                    City Manager                   |  90000   |     3     |
|      9      |    Ben     |    Wyatt     |                   State Auditor                   | 70000  |    6    |       9       |     Ben      |    Wyatt     |                   State Auditor                   |  70000   |     6     |
|      10     |    Andy    |    Dwyer     |              Shoe Shiner and Musician             | 20000  |   None  |       10      |     Andy     |    Dwyer     |              Shoe Shiner and Musician             |  20000   |    None   |
|      11     |    Mark    | Brendanawicz |                    City Planner                   | 57000  |    3    |       11      |     Mark     | Brendanawicz |                    City Planner                   |  57000   |     3     |
|      12     |   Craig    | Middlebrooks |                   Parks Director                  | 65000  |    1    |       12      |    Craig     | Middlebrooks |                   Parks Director                  |  65000   |     1     |
+-------------+------------+--------------+---------------------------------------------------+--------+---------+---------------+--------------+--------------+---------------------------------------------------+----------+-----------+

In [52]:
%%sql
SELECT *
FROM parks_and_recreation.employee_salary emp1
JOIN parks_and_recreation.employee_salary emp2
ON emp1.employee_id + 1 = emp2.employee_id;

Running query in 'mysql+mysqldb://root:***@localhost:3306/parks_and_recreation'

11 rows affected.

+-------------+------------+--------------+---------------------------------------------------+--------+---------+---------------+--------------+--------------+---------------------------------------------------+----------+-----------+
| employee_id | first_name |  last_name   |                     occupation                    | salary | dept_id | employee_id_1 | first_name_1 | last_name_1  |                    occupation_1                   | salary_1 | dept_id_1 |
+-------------+------------+--------------+---------------------------------------------------+--------+---------+---------------+--------------+--------------+---------------------------------------------------+----------+-----------+
|      1      |   Leslie   |    Knope     |      Deputy Director of Parks and Recreation      | 75000  |    1    |       2       |     Ron      |   Swanson    |          Director of Parks and Recreation         |  70000   |     1     |
|      2      |    Ron     |   Swanson    |          Director of Parks and Recreation         | 70000  |    1    |       3       |     Tom      |  Haverford   |                    Entrepreneur                   |  50000   |     1     |
|      3      |    Tom     |  Haverford   |                    Entrepreneur                   | 50000  |    1    |       4       |    April     |   Ludgate    | Assistant to the Director of Parks and Recreation |  25000   |     1     |
|      4      |   April    |   Ludgate    | Assistant to the Director of Parks and Recreation | 25000  |    1    |       5       |    Jerry     |   Gergich    |                   Office Manager                  |  50000   |     1     |
|      5      |   Jerry    |   Gergich    |                   Office Manager                  | 50000  |    1    |       6       |    Donna     |    Meagle    |                   Office Manager                  |  60000   |     1     |
|      6      |   Donna    |    Meagle    |                   Office Manager                  | 60000  |    1    |       7       |     Ann      |   Perkins    |                       Nurse                       |  55000   |     4     |
|      7      |    Ann     |   Perkins    |                       Nurse                       | 55000  |    4    |       8       |    Chris     |   Traeger    |                    City Manager                   |  90000   |     3     |
|      8      |   Chris    |   Traeger    |                    City Manager                   | 90000  |    3    |       9       |     Ben      |    Wyatt     |                   State Auditor                   |  70000   |     6     |
|      9      |    Ben     |    Wyatt     |                   State Auditor                   | 70000  |    6    |       10      |     Andy     |    Dwyer     |              Shoe Shiner and Musician             |  20000   |    None   |
|      10     |    Andy    |    Dwyer     |              Shoe Shiner and Musician             | 20000  |   None  |       11      |     Mark     | Brendanawicz |                    City Planner                   |  57000   |     3     |
|      11     |    Mark    | Brendanawicz |                    City Planner                   | 57000  |    3    |       12      |    Craig     | Middlebrooks |                   Parks Director                  |  65000   |     1     |
+-------------+------------+--------------+---------------------------------------------------+--------+---------+---------------+--------------+--------------+---------------------------------------------------+----------+-----------+

Joining multiple tables together

In [53]:
%%sql
SELECT *
FROM parks_and_recreation.employee_demographics AS dem
INNER JOIN parks_and_recreation.employee_salary AS sal
ON dem.employee_id = sal.employee_id
INNER JOIN parks_and_recreation.parks_departments AS pd
ON sal.dept_id = pd.department_id;

Running query in 'mysql+mysqldb://root:***@localhost:3306/parks_and_recreation'

10 rows affected.

+-------------+------------+--------------+-----+--------+------------+---------------+--------------+--------------+---------------------------------------------------+--------+---------+---------------+----------------------+
| employee_id | first_name |  last_name   | age | gender | birth_date | employee_id_1 | first_name_1 | last_name_1  |                     occupation                    | salary | dept_id | department_id |   department_name    |
+-------------+------------+--------------+-----+--------+------------+---------------+--------------+--------------+---------------------------------------------------+--------+---------+---------------+----------------------+
|      1      |   Leslie   |    Knope     |  44 | Female | 1979-09-25 |       1       |    Leslie    |    Knope     |      Deputy Director of Parks and Recreation      | 75000  |    1    |       1       | Parks and Recreation |
|      3      |    Tom     |  Haverford   |  36 |  Male  | 1987-03-04 |       3       |     Tom      |  Haverford   |                    Entrepreneur                   | 50000  |    1    |       1       | Parks and Recreation |
|      4      |   April    |   Ludgate    |  29 | Female | 1994-03-27 |       4       |    April     |   Ludgate    | Assistant to the Director of Parks and Recreation | 25000  |    1    |       1       | Parks and Recreation |
|      5      |   Jerry    |   Gergich    |  61 |  Male  | 1962-08-28 |       5       |    Jerry     |   Gergich    |                   Office Manager                  | 50000  |    1    |       1       | Parks and Recreation |
|      6      |   Donna    |    Meagle    |  46 | Female | 1977-07-30 |       6       |    Donna     |    Meagle    |                   Office Manager                  | 60000  |    1    |       1       | Parks and Recreation |
|      7      |    Ann     |   Perkins    |  35 | Female | 1988-12-01 |       7       |     Ann      |   Perkins    |                       Nurse                       | 55000  |    4    |       4       |      Healthcare      |
|      8      |   Chris    |   Traeger    |  43 |  Male  | 1980-11-11 |       8       |    Chris     |   Traeger    |                    City Manager                   | 90000  |    3    |       3       |     Public Works     |
|      9      |    Ben     |    Wyatt     |  38 |  Male  | 1985-07-26 |       9       |     Ben      |    Wyatt     |                   State Auditor                   | 70000  |    6    |       6       |       Finance        |
|      11     |    Mark    | Brendanawicz |  40 |  Male  | 1983-06-14 |       11      |     Mark     | Brendanawicz |                    City Planner                   | 57000  |    3    |       3       |     Public Works     |
|      12     |   Craig    | Middlebrooks |  37 |  Male  | 1986-07-27 |       12      |    Craig     | Middlebrooks |                   Parks Director                  | 65000  |    1    |       1       | Parks and Recreation |
+-------------+------------+--------------+-----+--------+------------+---------------+--------------+--------------+---------------------------------------------------+--------+---------+---------------+----------------------+

## SQL_06
Unions

In [54]:
%%sql
SELECT *
FROM parks_and_recreation.employee_demographics;

Running query in 'mysql+mysqldb://root:***@localhost:3306/parks_and_recreation'

11 rows affected.

+-------------+------------+--------------+-----+--------+------------+
| employee_id | first_name |  last_name   | age | gender | birth_date |
+-------------+------------+--------------+-----+--------+------------+
|      1      |   Leslie   |    Knope     |  44 | Female | 1979-09-25 |
|      3      |    Tom     |  Haverford   |  36 |  Male  | 1987-03-04 |
|      4      |   April    |   Ludgate    |  29 | Female | 1994-03-27 |
|      5      |   Jerry    |   Gergich    |  61 |  Male  | 1962-08-28 |
|      6      |   Donna    |    Meagle    |  46 | Female | 1977-07-30 |
|      7      |    Ann     |   Perkins    |  35 | Female | 1988-12-01 |
|      8      |   Chris    |   Traeger    |  43 |  Male  | 1980-11-11 |
|      9      |    Ben     |    Wyatt     |  38 |  Male  | 1985-07-26 |
|      10     |    Andy    |    Dwyer     |  34 |  Male  | 1989-03-25 |
|      11     |    Mark    | Brendanawicz |  40 |  Male  | 1983-06-14 |
|      12     |   Craig    | Middlebrooks |  37 |  Male  | 1986-07-27 |
+-------------+------------+--------------+-----+--------+------------+

In [55]:
%%sql
SELECT age, gender
FROM parks_and_recreation.employee_demographics
UNION
SELECT first_name, last_name
FROM parks_and_recreation.employee_salary;

Running query in 'mysql+mysqldb://root:***@localhost:3306/parks_and_recreation'

23 rows affected.

+--------+--------------+
|  age   |    gender    |
+--------+--------------+
|   44   |    Female    |
|   36   |     Male     |
|   29   |    Female    |
|   61   |     Male     |
|   46   |    Female    |
|   35   |    Female    |
|   43   |     Male     |
|   38   |     Male     |
|   34   |     Male     |
|   40   |     Male     |
|   37   |     Male     |
| Leslie |    Knope     |
|  Ron   |   Swanson    |
|  Tom   |  Haverford   |
| April  |   Ludgate    |
| Jerry  |   Gergich    |
| Donna  |    Meagle    |
|  Ann   |   Perkins    |
| Chris  |   Traeger    |
|  Ben   |    Wyatt     |
|  Andy  |    Dwyer     |
|  Mark  | Brendanawicz |
| Craig  | Middlebrooks |
+--------+--------------+

In [56]:
%%sql
SELECT first_name, last_name
FROM parks_and_recreation.employee_demographics
UNION
SELECT first_name, last_name
FROM parks_and_recreation.employee_salary;

Running query in 'mysql+mysqldb://root:***@localhost:3306/parks_and_recreation'

12 rows affected.

+------------+--------------+
| first_name |  last_name   |
+------------+--------------+
|   Leslie   |    Knope     |
|    Tom     |  Haverford   |
|   April    |   Ludgate    |
|   Jerry    |   Gergich    |
|   Donna    |    Meagle    |
|    Ann     |   Perkins    |
|   Chris    |   Traeger    |
|    Ben     |    Wyatt     |
|    Andy    |    Dwyer     |
|    Mark    | Brendanawicz |
|   Craig    | Middlebrooks |
|    Ron     |   Swanson    |
+------------+--------------+

In [57]:
%%sql
SELECT first_name, last_name
FROM parks_and_recreation.employee_demographics
UNION DISTINCT
SELECT first_name, last_name
FROM parks_and_recreation.employee_salary;

Running query in 'mysql+mysqldb://root:***@localhost:3306/parks_and_recreation'

12 rows affected.

+------------+--------------+
| first_name |  last_name   |
+------------+--------------+
|   Leslie   |    Knope     |
|    Tom     |  Haverford   |
|   April    |   Ludgate    |
|   Jerry    |   Gergich    |
|   Donna    |    Meagle    |
|    Ann     |   Perkins    |
|   Chris    |   Traeger    |
|    Ben     |    Wyatt     |
|    Andy    |    Dwyer     |
|    Mark    | Brendanawicz |
|   Craig    | Middlebrooks |
|    Ron     |   Swanson    |
+------------+--------------+

In [58]:
%%sql
SELECT first_name, last_name
FROM parks_and_recreation.employee_demographics
UNION ALL
SELECT first_name, last_name
FROM parks_and_recreation.employee_salary;

Running query in 'mysql+mysqldb://root:***@localhost:3306/parks_and_recreation'

23 rows affected.

+------------+--------------+
| first_name |  last_name   |
+------------+--------------+
|   Leslie   |    Knope     |
|    Tom     |  Haverford   |
|   April    |   Ludgate    |
|   Jerry    |   Gergich    |
|   Donna    |    Meagle    |
|    Ann     |   Perkins    |
|   Chris    |   Traeger    |
|    Ben     |    Wyatt     |
|    Andy    |    Dwyer     |
|    Mark    | Brendanawicz |
|   Craig    | Middlebrooks |
|   Leslie   |    Knope     |
|    Ron     |   Swanson    |
|    Tom     |  Haverford   |
|   April    |   Ludgate    |
|   Jerry    |   Gergich    |
|   Donna    |    Meagle    |
|    Ann     |   Perkins    |
|   Chris    |   Traeger    |
|    Ben     |    Wyatt     |
|    Andy    |    Dwyer     |
|    Mark    | Brendanawicz |
|   Craig    | Middlebrooks |
+------------+--------------+

In [59]:
%%sql
SELECT first_name, last_name, "Old"
FROM parks_and_recreation.employee_demographics
WHERE age > 50;

Running query in 'mysql+mysqldb://root:***@localhost:3306/parks_and_recreation'

1 rows affected.

+------------+-----------+-----+
| first_name | last_name | Old |
+------------+-----------+-----+
|   Jerry    |  Gergich  | Old |
+------------+-----------+-----+

In [60]:
%%sql
SELECT first_name, last_name, "Old" AS Label
FROM parks_and_recreation.employee_demographics
WHERE age > 50;

Running query in 'mysql+mysqldb://root:***@localhost:3306/parks_and_recreation'

1 rows affected.

+------------+-----------+-------+
| first_name | last_name | Label |
+------------+-----------+-------+
|   Jerry    |  Gergich  |  Old  |
+------------+-----------+-------+

In [61]:
%%sql
SELECT first_name, last_name, "Old" AS Label
FROM parks_and_recreation.employee_demographics
WHERE age > 50
UNION
SELECT first_name, last_name, "Highly Paid Employee" AS Label
FROM parks_and_recreation.employee_salary
WHERE salary > 70000;

Running query in 'mysql+mysqldb://root:***@localhost:3306/parks_and_recreation'

3 rows affected.

+------------+-----------+----------------------+
| first_name | last_name |        Label         |
+------------+-----------+----------------------+
|   Jerry    |  Gergich  |         Old          |
|   Leslie   |   Knope   | Highly Paid Employee |
|   Chris    |  Traeger  | Highly Paid Employee |
+------------+-----------+----------------------+

In [62]:
%%sql
SELECT first_name, last_name, "Old Man" AS Label
FROM parks_and_recreation.employee_demographics
WHERE age > 40 AND gender = "Male"
UNION
SELECT first_name, last_name, "Old Lady" AS Label
FROM parks_and_recreation.employee_demographics
WHERE age > 40 AND gender = "Female"
UNION
SELECT first_name, last_name, "Highly Paid Employee" AS Label
FROM parks_and_recreation.employee_salary
WHERE salary > 70000
ORDER BY first_name, last_name;

Running query in 'mysql+mysqldb://root:***@localhost:3306/parks_and_recreation'

6 rows affected.

+------------+-----------+----------------------+
| first_name | last_name |        Label         |
+------------+-----------+----------------------+
|   Chris    |  Traeger  |       Old Man        |
|   Chris    |  Traeger  | Highly Paid Employee |
|   Donna    |   Meagle  |       Old Lady       |
|   Jerry    |  Gergich  |       Old Man        |
|   Leslie   |   Knope   |       Old Lady       |
|   Leslie   |   Knope   | Highly Paid Employee |
+------------+-----------+----------------------+

## SQL_07
String functions

In [63]:
%%sql
SELECT LENGTH("skyfall");

Running query in 'mysql+mysqldb://root:***@localhost:3306/parks_and_recreation'

1 rows affected.

+-------------------+
| LENGTH("skyfall") |
+-------------------+
|         7         |
+-------------------+

In [64]:
%%sql
SELECT first_name, LENGTH(first_name) AS Largo
FROM parks_and_recreation.employee_demographics
ORDER BY 2;

Running query in 'mysql+mysqldb://root:***@localhost:3306/parks_and_recreation'

11 rows affected.

+------------+-------+
| first_name | Largo |
+------------+-------+
|    Tom     |   3   |
|    Ann     |   3   |
|    Ben     |   3   |
|    Andy    |   4   |
|    Mark    |   4   |
|   April    |   5   |
|   Jerry    |   5   |
|   Donna    |   5   |
|   Chris    |   5   |
|   Craig    |   5   |
|   Leslie   |   6   |
+------------+-------+

In [65]:
%sql SELECT UPPER("sky");

Running query in 'mysql+mysqldb://root:***@localhost:3306/parks_and_recreation'

1 rows affected.

+--------------+
| UPPER("sky") |
+--------------+
|     SKY      |
+--------------+

In [66]:
%sql SELECT LOWER("SKY");

Running query in 'mysql+mysqldb://root:***@localhost:3306/parks_and_recreation'

1 rows affected.

+--------------+
| LOWER("SKY") |
+--------------+
|     sky      |
+--------------+

In [67]:
%%sql
SELECT first_name, UPPER(first_name)
FROM parks_and_recreation.employee_demographics;

Running query in 'mysql+mysqldb://root:***@localhost:3306/parks_and_recreation'

11 rows affected.

+------------+-------------------+
| first_name | UPPER(first_name) |
+------------+-------------------+
|   Leslie   |       LESLIE      |
|    Tom     |        TOM        |
|   April    |       APRIL       |
|   Jerry    |       JERRY       |
|   Donna    |       DONNA       |
|    Ann     |        ANN        |
|   Chris    |       CHRIS       |
|    Ben     |        BEN        |
|    Andy    |        ANDY       |
|    Mark    |        MARK       |
|   Craig    |       CRAIG       |
+------------+-------------------+

In [68]:
%%sql
SELECT first_name, LOWER(first_name)
FROM parks_and_recreation.employee_demographics;

Running query in 'mysql+mysqldb://root:***@localhost:3306/parks_and_recreation'

11 rows affected.

+------------+-------------------+
| first_name | LOWER(first_name) |
+------------+-------------------+
|   Leslie   |       leslie      |
|    Tom     |        tom        |
|   April    |       april       |
|   Jerry    |       jerry       |
|   Donna    |       donna       |
|    Ann     |        ann        |
|   Chris    |       chris       |
|    Ben     |        ben        |
|    Andy    |        andy       |
|    Mark    |        mark       |
|   Craig    |       craig       |
+------------+-------------------+

In [69]:
%%sql
SELECT TRIM('    sky    ');

Running query in 'mysql+mysqldb://root:***@localhost:3306/parks_and_recreation'

1 rows affected.

+---------------------+
| TRIM('    sky    ') |
+---------------------+
|         sky         |
+---------------------+

In [70]:
%%sql
SELECT LTRIM('    sky    ');

Running query in 'mysql+mysqldb://root:***@localhost:3306/parks_and_recreation'

1 rows affected.

+----------------------+
| LTRIM('    sky    ') |
+----------------------+
|       sky            |
+----------------------+

In [71]:
%%sql
SELECT RTRIM('    sky    ');

Running query in 'mysql+mysqldb://root:***@localhost:3306/parks_and_recreation'

1 rows affected.

+----------------------+
| RTRIM('    sky    ') |
+----------------------+
|           sky        |
+----------------------+

In [72]:
%%sql
SELECT first_name, LEFT(first_name, 4),
RIGHT(first_name, 4),
SUBSTRING(first_name, 3, 2),
birth_date,
SUBSTRING(birth_date, 6, 2) As Month
FROM parks_and_recreation.employee_demographics;

Running query in 'mysql+mysqldb://root:***@localhost:3306/parks_and_recreation'

11 rows affected.

+------------+---------------------+----------------------+-----------------------------+------------+-------+
| first_name | LEFT(first_name, 4) | RIGHT(first_name, 4) | SUBSTRING(first_name, 3, 2) | birth_date | Month |
+------------+---------------------+----------------------+-----------------------------+------------+-------+
|   Leslie   |         Lesl        |         slie         |              sl             | 1979-09-25 |   09  |
|    Tom     |         Tom         |         Tom          |              m              | 1987-03-04 |   03  |
|   April    |         Apri        |         pril         |              ri             | 1994-03-27 |   03  |
|   Jerry    |         Jerr        |         erry         |              rr             | 1962-08-28 |   08  |
|   Donna    |         Donn        |         onna         |              nn             | 1977-07-30 |   07  |
|    Ann     |         Ann         |         Ann          |              n              | 1988-12-01 |   12  |
|   Chris    |         Chri        |         hris         |              ri             | 1980-11-11 |   11  |
|    Ben     |         Ben         |         Ben          |              n              | 1985-07-26 |   07  |
|    Andy    |         Andy        |         Andy         |              dy             | 1989-03-25 |   03  |
|    Mark    |         Mark        |         Mark         |              rk             | 1983-06-14 |   06  |
|   Craig    |         Crai        |         raig         |              ai             | 1986-07-27 |   07  |
+------------+---------------------+----------------------+-----------------------------+------------+-------+

In [73]:
%%sql
SELECT first_name, REPLACE(first_name, "a", "z")
FROM parks_and_recreation.employee_demographics;

Running query in 'mysql+mysqldb://root:***@localhost:3306/parks_and_recreation'

11 rows affected.

+------------+-------------------------------+
| first_name | REPLACE(first_name, "a", "z") |
+------------+-------------------------------+
|   Leslie   |             Leslie            |
|    Tom     |              Tom              |
|   April    |             April             |
|   Jerry    |             Jerry             |
|   Donna    |             Donnz             |
|    Ann     |              Ann              |
|   Chris    |             Chris             |
|    Ben     |              Ben              |
|    Andy    |              Andy             |
|    Mark    |              Mzrk             |
|   Craig    |             Crzig             |
+------------+-------------------------------+

In [74]:
%%sql
SELECT first_name, LOCATE("An", first_name)
FROM parks_and_recreation.employee_demographics;

Running query in 'mysql+mysqldb://root:***@localhost:3306/parks_and_recreation'

11 rows affected.

+------------+--------------------------+
| first_name | LOCATE("An", first_name) |
+------------+--------------------------+
|   Leslie   |            0             |
|    Tom     |            0             |
|   April    |            0             |
|   Jerry    |            0             |
|   Donna    |            0             |
|    Ann     |            1             |
|   Chris    |            0             |
|    Ben     |            0             |
|    Andy    |            1             |
|    Mark    |            0             |
|   Craig    |            0             |
+------------+--------------------------+

In [75]:
%%sql
SELECT first_name, last_name,
CONCAT(first_name, " ", last_name) AS "Full name"
FROM parks_and_recreation.employee_demographics;

Running query in 'mysql+mysqldb://root:***@localhost:3306/parks_and_recreation'

11 rows affected.

+------------+--------------+--------------------+
| first_name |  last_name   |     Full name      |
+------------+--------------+--------------------+
|   Leslie   |    Knope     |    Leslie Knope    |
|    Tom     |  Haverford   |   Tom Haverford    |
|   April    |   Ludgate    |   April Ludgate    |
|   Jerry    |   Gergich    |   Jerry Gergich    |
|   Donna    |    Meagle    |    Donna Meagle    |
|    Ann     |   Perkins    |    Ann Perkins     |
|   Chris    |   Traeger    |   Chris Traeger    |
|    Ben     |    Wyatt     |     Ben Wyatt      |
|    Andy    |    Dwyer     |     Andy Dwyer     |
|    Mark    | Brendanawicz | Mark Brendanawicz  |
|   Craig    | Middlebrooks | Craig Middlebrooks |
+------------+--------------+--------------------+

## SQL_08
Case statements

In [76]:
%%sql
SELECT first_name, last_name, age,
CASE
    WHEN age <= 30 THEN "Young"
    WHEN age BETWEEN 31 AND 50 THEN "Old"
    WHEN age >= 50 THEN "On Death's Door"
END AS alias
FROM parks_and_recreation.employee_demographics;

Running query in 'mysql+mysqldb://root:***@localhost:3306/parks_and_recreation'

11 rows affected.

+------------+--------------+-----+-----------------+
| first_name |  last_name   | age |      alias      |
+------------+--------------+-----+-----------------+
|   Leslie   |    Knope     |  44 |       Old       |
|    Tom     |  Haverford   |  36 |       Old       |
|   April    |   Ludgate    |  29 |      Young      |
|   Jerry    |   Gergich    |  61 | On Death's Door |
|   Donna    |    Meagle    |  46 |       Old       |
|    Ann     |   Perkins    |  35 |       Old       |
|   Chris    |   Traeger    |  43 |       Old       |
|    Ben     |    Wyatt     |  38 |       Old       |
|    Andy    |    Dwyer     |  34 |       Old       |
|    Mark    | Brendanawicz |  40 |       Old       |
|   Craig    | Middlebrooks |  37 |       Old       |
+------------+--------------+-----+-----------------+

In [77]:
%%sql
SELECT first_name, last_name, salary,
CASE
    WHEN salary < 50000 THEN salary * 1.05
    WHEN salary > 50000 THEN salary * 1.07
END AS "New salary",
CASE
    WHEN dept_id = 6 THEN salary * .10
END AS Bonus
FROM parks_and_recreation.employee_salary;

Running query in 'mysql+mysqldb://root:***@localhost:3306/parks_and_recreation'

12 rows affected.

+------------+--------------+--------+------------+---------+
| first_name |  last_name   | salary | New salary |  Bonus  |
+------------+--------------+--------+------------+---------+
|   Leslie   |    Knope     | 75000  |  80250.00  |   None  |
|    Ron     |   Swanson    | 70000  |  74900.00  |   None  |
|    Tom     |  Haverford   | 50000  |    None    |   None  |
|   April    |   Ludgate    | 25000  |  26250.00  |   None  |
|   Jerry    |   Gergich    | 50000  |    None    |   None  |
|   Donna    |    Meagle    | 60000  |  64200.00  |   None  |
|    Ann     |   Perkins    | 55000  |  58850.00  |   None  |
|   Chris    |   Traeger    | 90000  |  96300.00  |   None  |
|    Ben     |    Wyatt     | 70000  |  74900.00  | 7000.00 |
|    Andy    |    Dwyer     | 20000  |  21000.00  |   None  |
|    Mark    | Brendanawicz | 57000  |  60990.00  |   None  |
|   Craig    | Middlebrooks | 65000  |  69550.00  |   None  |
+------------+--------------+--------+------------+---------+

## SQL_09
Subqueries

In [78]:
%%sql
SELECT *
FROM parks_and_recreation.employee_demographics
WHERE employee_id IN
    (SELECT employee_id
        FROM parks_and_recreation.employee_salary
            WHERE dept_id = 1);

Running query in 'mysql+mysqldb://root:***@localhost:3306/parks_and_recreation'

6 rows affected.

+-------------+------------+--------------+-----+--------+------------+
| employee_id | first_name |  last_name   | age | gender | birth_date |
+-------------+------------+--------------+-----+--------+------------+
|      1      |   Leslie   |    Knope     |  44 | Female | 1979-09-25 |
|      3      |    Tom     |  Haverford   |  36 |  Male  | 1987-03-04 |
|      4      |   April    |   Ludgate    |  29 | Female | 1994-03-27 |
|      5      |   Jerry    |   Gergich    |  61 |  Male  | 1962-08-28 |
|      6      |   Donna    |    Meagle    |  46 | Female | 1977-07-30 |
|      12     |   Craig    | Middlebrooks |  37 |  Male  | 1986-07-27 |
+-------------+------------+--------------+-----+--------+------------+

In [79]:
%%sql
SELECT first_name, salary,
(SELECT AVG(salary)
FROM parks_and_recreation.employee_salary)
FROM parks_and_recreation.employee_salary;

Running query in 'mysql+mysqldb://root:***@localhost:3306/parks_and_recreation'

12 rows affected.

+------------+--------+--------------------------------------------+
| first_name | salary |                      (SELECT AVG(salary)
FROM parks_and_recreation.employee_salary)                       |
+------------+--------+--------------------------------------------+
|   Leslie   | 75000  |                 57250.0000                 |
|    Ron     | 70000  |                 57250.0000                 |
|    Tom     | 50000  |                 57250.0000                 |
|   April    | 25000  |                 57250.0000                 |
|   Jerry    | 50000  |                 57250.0000                 |
|   Donna    | 60000  |                 57250.0000                 |
|    Ann     | 55000  |                 57250.0000                 |
|   Chris    | 90000  |                 57250.0000                 |
|    Ben     | 70000  |                 57250.0000                 |
|    Andy    | 20000  |                 57250.0000                 |
|    Mark    | 57000  |                 57250.0000                 |
|   Craig    | 65000  |                 57250.0000                 |
+------------+--------+--------------------------------------------+

In [80]:
%%sql
SELECT gender, AVG(age), MAX(age), MIN(age), COUNT(age)
FROM parks_and_recreation.employee_demographics
GROUP BY gender;

Running query in 'mysql+mysqldb://root:***@localhost:3306/parks_and_recreation'

2 rows affected.

+--------+----------+----------+----------+------------+
| gender | AVG(age) | MAX(age) | MIN(age) | COUNT(age) |
+--------+----------+----------+----------+------------+
| Female | 38.5000  |    46    |    29    |     4      |
|  Male  | 41.2857  |    61    |    34    |     7      |
+--------+----------+----------+----------+------------+

In [81]:
%%sql
SELECT *
FROM (
    SELECT gender, AVG(age), MAX(age), MIN(age), COUNT(age)
    FROM parks_and_recreation.employee_demographics
    GROUP BY gender
) as Agg_table;

Running query in 'mysql+mysqldb://root:***@localhost:3306/parks_and_recreation'

2 rows affected.

+--------+----------+----------+----------+------------+
| gender | AVG(age) | MAX(age) | MIN(age) | COUNT(age) |
+--------+----------+----------+----------+------------+
| Female | 38.5000  |    46    |    29    |     4      |
|  Male  | 41.2857  |    61    |    34    |     7      |
+--------+----------+----------+----------+------------+

In [82]:
%%sql
SELECT gender, AVG(`MAX(age)`)
FROM (
    SELECT gender, AVG(age), MAX(age), MIN(age), COUNT(age)
    FROM parks_and_recreation.employee_demographics
    GROUP BY gender
) as Agg_table
GROUP BY gender;

Running query in 'mysql+mysqldb://root:***@localhost:3306/parks_and_recreation'

2 rows affected.

+--------+-----------------+
| gender | AVG(`MAX(age)`) |
+--------+-----------------+
| Female |     46.0000     |
|  Male  |     61.0000     |
+--------+-----------------+

In [83]:
%%sql
SELECT AVG(max_age)
FROM (
    SELECT gender,
    AVG(age) AS avg_age,
    MAX(age) AS max_age,
    MIN(age) AS min_age,
    COUNT(age)
    FROM parks_and_recreation.employee_demographics
    GROUP BY gender
    ) as Agg_table;

Running query in 'mysql+mysqldb://root:***@localhost:3306/parks_and_recreation'

1 rows affected.

+--------------+
| AVG(max_age) |
+--------------+
|   53.5000    |
+--------------+

## SQL_09
Window function

In [84]:
%%sql
SELECT gender, AVG(salary) AS avg_salary
FROM parks_and_recreation.employee_demographics AS dem
JOIN parks_and_recreation.employee_salary AS sal
ON dem.employee_id = sal.employee_id
GROUP BY gender;

Running query in 'mysql+mysqldb://root:***@localhost:3306/parks_and_recreation'

2 rows affected.

+--------+------------+
| gender | avg_salary |
+--------+------------+
| Female | 53750.0000 |
|  Male  | 57428.5714 |
+--------+------------+

In [85]:
%%sql
SELECT dem.first_name, dem.last_name,
dem.gender, AVG(sal.salary) OVER(PARTITION BY dem.gender)
FROM parks_and_recreation.employee_demographics AS dem
JOIN parks_and_recreation.employee_salary AS sal
ON dem.employee_id = sal.employee_id;

Running query in 'mysql+mysqldb://root:***@localhost:3306/parks_and_recreation'

11 rows affected.

+------------+--------------+--------+-----------------------------------------------+
| first_name |  last_name   | gender | AVG(sal.salary) OVER(PARTITION BY dem.gender) |
+------------+--------------+--------+-----------------------------------------------+
|   Leslie   |    Knope     | Female |                   53750.0000                  |
|   April    |   Ludgate    | Female |                   53750.0000                  |
|   Donna    |    Meagle    | Female |                   53750.0000                  |
|    Ann     |   Perkins    | Female |                   53750.0000                  |
|    Tom     |  Haverford   |  Male  |                   57428.5714                  |
|   Jerry    |   Gergich    |  Male  |                   57428.5714                  |
|   Chris    |   Traeger    |  Male  |                   57428.5714                  |
|    Ben     |    Wyatt     |  Male  |                   57428.5714                  |
|    Andy    |    Dwyer     |  Male  |                   57428.5714                  |
|    Mark    | Brendanawicz |  Male  |                   57428.5714                  |
|   Craig    | Middlebrooks |  Male  |                   57428.5714                  |
+------------+--------------+--------+-----------------------------------------------+

In [86]:
%%sql
SELECT dem.first_name, dem.last_name,
dem.gender, SUM(sal.salary) OVER(PARTITION BY dem.gender)
FROM parks_and_recreation.employee_demographics AS dem
JOIN parks_and_recreation.employee_salary AS sal
ON dem.employee_id = sal.employee_id;

Running query in 'mysql+mysqldb://root:***@localhost:3306/parks_and_recreation'

11 rows affected.

+------------+--------------+--------+-----------------------------------------------+
| first_name |  last_name   | gender | SUM(sal.salary) OVER(PARTITION BY dem.gender) |
+------------+--------------+--------+-----------------------------------------------+
|   Leslie   |    Knope     | Female |                     215000                    |
|   April    |   Ludgate    | Female |                     215000                    |
|   Donna    |    Meagle    | Female |                     215000                    |
|    Ann     |   Perkins    | Female |                     215000                    |
|    Tom     |  Haverford   |  Male  |                     402000                    |
|   Jerry    |   Gergich    |  Male  |                     402000                    |
|   Chris    |   Traeger    |  Male  |                     402000                    |
|    Ben     |    Wyatt     |  Male  |                     402000                    |
|    Andy    |    Dwyer     |  Male  |                     402000                    |
|    Mark    | Brendanawicz |  Male  |                     402000                    |
|   Craig    | Middlebrooks |  Male  |                     402000                    |
+------------+--------------+--------+-----------------------------------------------+